<template>
  <div class="wrapper-flex">
    <TitleItem> 4. Многострочный текст в ячейке</TitleItem>
    <DataTable :value="data">
      <Column field="log" header="Лог" :body="formatLog"></Column>
    </DataTable>
  </div>
</template>

<script setup>
import { ref } from 'vue'
import DataTable from 'primevue/datatable'
import Column from 'primevue/column'
import TitleItem from './TitleItem.vue';

const data = ref([
  { log: '[13:36:53] Расчетное время: 9 мин\n[13:36:58] Открыть клапан откачки К1' },
  { log: '[13:36:58] Включить вакуумный насос\n[13:36:58] Закрыть клапан К5' },
  { log: '[13:36:58] Закрыть клапан дистилляции К2\n[13:36:58] Ожидание: 8 с' },
  { log: '[13:36:53] Расчетное время: 9 мин' },
  { log: '[13:36:58] Открыть клапан откачки К1' },
  { log: '[13:36:58] Включить вакуумный насос' },
  { log: '[13:36:58] Закрыть клапан К5' },
  { log: '[13:36:58] Закрыть клапан дистилляции К2' },
  { log: '[13:36:58] Ожидание: 8 с' },
  { log: '[13:37:06] Заливка 2.2мл. в испаритель' },
  { log: '[13:37:06] Заданно 26.50602409638554 шагов' },
  { log: '[13:37:09] Заливка перекиси завершена' },
  { log: '[13:37:09] Открыть клапан дистилляции К2' },
  { log: '[13:42:09] Включить нагрев испарителя' },
  { log: '[13:42:09] Закрыть клапан дистилляции К2' },
  { log: '[13:42:09] конечное давление1.0960040758227925 торр' },
  { log: '[13:42:09] Выпаривание через К2' },
  { log: '[13:42:09] Выпаривание длилось5 мин' },
  { log: '[13:42:09] Откачка до 1 торр' },
  { log: '[13:42:15] Закрыть клапан откачки К1' },
  { log: '[13:43:09] Открыть клапан откачки К1' },
  { log: '[13:43:14] Аппаратное смещение 0 денсит. = -0.313683180809021' },
  { log: '[13:43:14] Закрыть клапан дистилляции К2' }
])

const formatLog = (rowData) => {
  return 'pre', { style: { whiteSpace: 'pre-wrap' } }, rowData.log
}
</script>
